// 16_structure_1.cpp
#include<stdio.h>

int main()
{
	// 배열로 많은 데이터를 다룰수 있지만
	// 구조화된 데이터를 관리하기에는 한계가 있다.

	char* player_name;
	int player_hp;
	int player_position;
	int player_speed;
	int player_attack;

	char* monster_name;
	int monster_hp;
	int monster_position;
	int monster_speed;
	int monster_attack;

	char* monster_names[5];
	int monster_hp[5];
	int monster_position[5];
	int monster_speed[5];
	int monster_attack[5];

	/*
	----------------------------------------------------------------------------------------------------------
	|   player_names[0] |   player_names[1]   |   player_names[2]   |   player_names[3]   |   player_names[4]|
	----------------------------------------------------------------------------------------------------------
	----------------------------------------------------------------------------------------------------------
	|   player_hp[0]    |   player_hp[1]      |   player_hp[2]      |   player_hp[3]      |   player_hp[4]   |
	----------------------------------------------------------------------------------------------------------
	----------------------------------------------------------------------------------------------------------
	|   player_def[0]   |   player_def[1]     |   player_def[2]     |   player_def[3]     |   player_def[4]  |
	----------------------------------------------------------------------------------------------------------
	*/

	// 데이터를 묶어서 사용할 수 있어 관리가 용이아하다.
	struct Object
	{
		char* name;
		int hp;
		int defance;
	};

	struct Object player1, player2, player3;
	struct Object monster1, monster2, monster3;

	struct Monster
	{
		char* name;
		int hp;
		int position;
		int speed;
		int attack;
	};

	Monster monsters[10];
	monsters[0].hp;

	/*
	-----------------------------------------------------------------------------------------
	|   player1.name   |         player1.hp         |         player1.defence         |
	-----------------------------------------------------------------------------------------
	-----------------------------------------------------------------------------------------
	|   player2.name   |         player2.hp         |         player2.defence         |
	-----------------------------------------------------------------------------------------
	-----------------------------------------------------------------------------------------
	|   player3.name   |         player3.hp         |         player3.defence         |
	-----------------------------------------------------------------------------------------
	-----------------------------------------------------------------------------------------
	|   player4.name   |         player4.hp         |         player4.defence         |
	-----------------------------------------------------------------------------------------
	-----------------------------------------------------------------------------------------
	|   player5.name   |         player5.hp         |         player5.defence         |
	-----------------------------------------------------------------------------------------
*/


	return 0;
}